In [2]:
import numpy as np
import pandas as pd

/tmp/ipykernel_4027/1662815981.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

# INDEXING, return single value

In [3]:
# LIST 1D
l=[1,2,3,4,5,6]
l[3]

4

In [4]:
# ARRAY 1D
arr = np.array([1,2,3,4,5,6])
arr[3]

4

In [5]:
# LIST 2D
l=[[1,2,3],[4,5,6]]
l[1][0]

4

In [6]:
# ARRAY 2D
arr = np.array([[1,2,3],[4,5,6]])
arr[1][0]

4

In [7]:
# DATAFRAME 2D

l = [['M.S.Dhoni', 36, 75, 5428000],
     ['A.B.D Villers', 38, 74, 3428000],
     ['V.Kohli', 31, 70, 8428000],
     ['S.Smith', 34, 80, 4428000],
     ['C.Gayle', 40, 100, 4528000],
     ['J.Root', 33, 72, 7028000],
     ['K.Peterson', 42, 85, 2528000]]

# creating a pandas dataframe
df = pd.DataFrame(l, columns=['Name', 'Age', 'Weight', 'Salary'])

df.iloc[1][0] #iloc mwans integer location

/tmp/ipykernel_4027/146542537.py:14: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][0] #iloc mwans integer location

'A.B.D Villers'

# SLICING 
* For 1D [start : stop : indexJump] and 
* stop -  optional, by default upto end
* indexJump -  optional, default = 1 

* for 2D array and dataframe-  
  * [start : stop : indexJump, start : stop : indexJump]
  * 2nd part is for columns and optional
  * For column selection, for row at least semicolon must be written 
    * [,1:5:2] is wrong
    * [:,1:5:2] is correct

In [8]:
# LIST 1D
l=[1,2,3,4,5,6,7,8,9]
l[1:5:2]

[2, 4]

In [9]:
# ARRAY 1D
arr = np.array([1,2,3,4,5,6,7,8,9])
arr[1:5:2]

array([2, 4])

In [10]:
# LIST 2D
l=[[1,2,3],[4,5,6],[7,8,9]]
l[:2]

[[1, 2, 3], [4, 5, 6]]

In [11]:
# ARRAY 2D
arr = np.array([[1,2,3],[4,5,6],[7,8,9]])
arr[:2,0:1]

array([[1],
       [4]])

In [15]:
# DATAFRAME 2D
df.iloc[:,1:5:1]

   Age  Weight   Salary
0   36      75  5428000
1   38      74  3428000
2   31      70  8428000
3   34      80  4428000
4   40     100  4528000
5   33      72  7028000
6   42      85  2528000

In [14]:
df.iloc[1,0]

'A.B.D Villers'

# SLICING - Dataframe special
### based on columns

In [16]:
# one columns, selecting single column return pandas series
df['Age']

0    36
1    38
2    31
3    34
4    40
5    33
6    42
Name: Age, dtype: int64

In [19]:
# multiple column, return dataframe
df[['Age','Name']]

   Age           Name
0   36      M.S.Dhoni
1   38  A.B.D Villers
2   31        V.Kohli
3   34        S.Smith
4   40        C.Gayle
5   33         J.Root
6   42     K.Peterson

# SLICING -Dataframe special
### loc

In [31]:
df.loc[31:33]

Empty DataFrame
Columns: [Name, Age, Weight, Salary]
Index: []

# FILTERING - Dataframe
* Internal condition will return true, false
* Only those rows will be selected for which condition is true

In [36]:
df['Age'] > 34 # return lis of True and False

0     True
1     True
2    False
3    False
4     True
5    False
6     True
Name: Age, dtype: bool

In [32]:
df[df['Age'] > 34]

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
4        C.Gayle   40     100  4528000
6     K.Peterson   42      85  2528000

In [33]:
df[ (df['Age'] > 34) & (df['Salary'] < 4000000) ]

            Name  Age  Weight   Salary
1  A.B.D Villers   38      74  3428000
6     K.Peterson   42      85  2528000

In [35]:
namelist = ['C.Gayle', 'M.S.Dhoni']
df[ df['Name'].isin(namelist)]

        Name  Age  Weight   Salary
0  M.S.Dhoni   36      75  5428000
4    C.Gayle   40     100  4528000

In [40]:
df[ df['Age'].between(30,40)]

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kohli   31      70  8428000
3        S.Smith   34      80  4428000
4        C.Gayle   40     100  4528000
5         J.Root   33      72  7028000